## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:45" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:45" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:faeef94a6bf91faa7e4ee3ac942bd03ddb536fb298456f56a12586ac1410a5ea" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:6486692f84a1ae696a45ca7441c3fa1733d216fc6af1c9bfe0c89788236a637d"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 45 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "941a24008125db82f9a3944a10abe9e9-5" -> "03f26d9515a21efcc51fb0dc9cc27268"
        id                     = "cpfValidation.03f26d9515a21efcc51fb0dc9cc27268.zip"
        tags                   = {}
      ~ version_id             = "C4Qe_BuBefvi6ERafnINsRsRwprCb4ZF" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "b08aae30188b2349c62ad4146d6e4e5c-6" -> "f12d747e0b78b872f335428cbff9a31b"
        id                     = "excelToJson.f12d747e0b78b872f335428cbff9a31b.zip"
        tags                   = {}
      ~ version_id             = "X6CcTwSyT._aC_bildP3YFUbDcSCHpVT" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "b008cd515b3b286b32f33b738233ed1b-6" -> "abc833777b8a184bc51c0889bec3c00b"
        id                     = "graphql.abc833777b8a184bc51c0889bec3c00b.zip"
        tags                   = {}
      ~ version_id             = "Js2xTCbLKHertcl4q1nIJvOI9yVG7sF3" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "7a39e85e565c2b5183cd17b253b49a50" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        id                     = "dist/200.html"
      ~ source_hash            = "7a39e85e565c2b5183cd17b253b49a50" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        tags                   = {}
      ~ version_id             = "dIpOPxQZsPXtUNFVuNyXNj1lmuZZ5cIQ" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "9fd17382ccfc1271517ee4da309f1aff" -> "8eacf0ad5ea30fe10f5f0765221734b3"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "9fd17382ccfc1271517ee4da309f1aff" -> "8eacf0ad5ea30fe10f5f0765221734b3"
        tags                   = {}
      ~ version_id             = "fGy1bwoCFcoeBRbH4UQ0V0nGCMoQQTvr" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "d4540a7c91d90939d0cd64d80fd189a5" -> "efb4158acaee6a39e70d443d4cec84e4"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "d4540a7c91d90939d0cd64d80fd189a5" -> "efb4158acaee6a39e70d443d4cec84e4"
        tags                   = {}
      ~ version_id             = "jCTMGCUz_VSZJRvd4HUVKyFfp70Ks1jJ" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "7a39e85e565c2b5183cd17b253b49a50" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        id                     = "dist/index.html"
      ~ source_hash            = "7a39e85e565c2b5183cd17b253b49a50" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        tags                   = {}
      ~ version_id             = "fhtMqw5L6Osw3.J_gWYBMbraHYvtWRw6" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.42c4eec0.js"] will be destroyed
  # (because key ["static/js/app.42c4eec0.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "cec3bae138666e81051618fe6b89176c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.42c4eec0.js" -> null
-       key                    = "dist/static/js/app.42c4eec0.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.42c4eec0.js" -> null
-       source_hash            = "cec3bae138666e81051618fe6b89176c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "wg7ol1q4hPla7N5ijT6ZNmLHR.kAfLqC" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.42c4eec0.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.42c4eec0.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "9806104531a6dc74425d37448a95fecc" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.42c4eec0.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.42c4eec0.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.42c4eec0.js.LICENSE.txt" -> null
-       source_hash            = "9806104531a6dc74425d37448a95fecc" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "MHyBIKRrTDW99rxDNIfnQJ5MMD8f32LW" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a2860e25.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f15abf167ebcb6da979cb68ee9e19ffe"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a2860e25.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a2860e25.js"
+       source_hash            = "f15abf167ebcb6da979cb68ee9e19ffe"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a2860e25.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9806104531a6dc74425d37448a95fecc"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a2860e25.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a2860e25.js.LICENSE.txt"
+       source_hash            = "9806104531a6dc74425d37448a95fecc"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:14" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:14/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "14" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "abc801e74b1b5d8fe47bf09a4c99130a068c01bb" -> "bf39415071219ab4ca948b560af7220c234f60ad"
              ~ "DD_TAGS"                      = "git.commit.sha:abc801e74b1b5d8fe47bf09a4c99130a068c01bb,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:bf39415071219ab4ca948b560af7220c234f60ad,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "abc801e74b1b5d8fe47bf09a4c99130a068c01bb" -> "bf39415071219ab4ca948b560af7220c234f60ad"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "14" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:14" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:14/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "14" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "abc801e74b1b5d8fe47bf09a4c99130a068c01bb" -> "bf39415071219ab4ca948b560af7220c234f60ad"
              ~ "DD_TAGS"                      = "git.commit.sha:abc801e74b1b5d8fe47bf09a4c99130a068c01bb,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:bf39415071219ab4ca948b560af7220c234f60ad,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "abc801e74b1b5d8fe47bf09a4c99130a068c01bb" -> "bf39415071219ab4ca948b560af7220c234f60ad"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "14" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:61" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:61/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "61" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "abc801e74b1b5d8fe47bf09a4c99130a068c01bb" -> "bf39415071219ab4ca948b560af7220c234f60ad"
              ~ "DD_TAGS"                            = "git.commit.sha:abc801e74b1b5d8fe47bf09a4c99130a068c01bb,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:bf39415071219ab4ca948b560af7220c234f60ad,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "abc801e74b1b5d8fe47bf09a4c99130a068c01bb" -> "bf39415071219ab4ca948b560af7220c234f60ad"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "61" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.reporting_data_bucket.aws_s3_bucket_cors_configuration.default[0] will be created
+   resource "aws_s3_bucket_cors_configuration" "default" {
+       bucket = "cpfreporter-reportingdata-357150818708-us-west-2"
+       id     = (known after apply)

+       cors_rule {
+           allowed_headers = [
+               "*",
            ]
+           allowed_methods = [
+               "GET",
+               "HEAD",
+               "POST",
+               "PUT",
            ]
+           allowed_origins = [
+               "staging.cpf.usdr.dev",
            ]
+           expose_headers  = [
+               "Content-Disposition",
+               "Content-Encoding",
+               "Content-Length",
+               "Content-Location",
+               "Content-Range",
+               "Date",
+               "ETag",
+               "Server",
+               "x-amz-delete-marker",
+               "x-amz-id-2",
+               "x-amz-request-id",
+               "x-amz-server-side-encryption",
+               "x-amz-version-id",
            ]
+           max_age_seconds = 300
        }
    }

Plan: 7 to add, 11 to change, 6 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7806459827)*